<h1>Pandas 기초 내부교육 교육교재 - 하성호</h1>

In [1]:
import pandas as pd
import numpy as np

In [2]:
# 첫번째 자료구조 Series - 1차원 배열의 성질을 가지는 자료구조

In [3]:
s = pd.Series([1,2,3,4,5])

In [4]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
s = pd.Series(['하나', '둘', '셋'])
s

0    하나
1     둘
2     셋
dtype: object

In [6]:
print(s)
print(type(s))

0    하나
1     둘
2     셋
dtype: object
<class 'pandas.core.series.Series'>

In [7]:
#날짜를 이용한 연습

In [8]:
dates = pd.date_range('2020-02-10', periods=7)
dates

DatetimeIndex(['2020-02-10', '2020-02-11', '2020-02-12', '2020-02-13',
               '2020-02-14', '2020-02-15', '2020-02-16'],
              dtype='datetime64[ns]', freq='D')

In [9]:
#2차원 배열의 자료구조
#DataFrame(data<narray>, index, columns, dtype<data type to force, default None>, copy<copy from inputs>)

df = pd.DataFrame(np.random.randn(7, 2), index=dates, columns=['A','B'])
print(df)

print(type(df))

                   A         B
2020-02-10  1.956552  0.083488
2020-02-11 -1.675167 -1.566508
2020-02-12 -0.042443 -0.718691
2020-02-13  0.487531 -0.019301
2020-02-14 -0.961005 -1.712802
2020-02-15 -0.015690 -1.203452
2020-02-16  2.410732 -0.468477
<class 'pandas.core.frame.DataFrame'>

In [10]:
#numpy.random.randint(low, high=None, size=None) - 시작값, 끝값, 사이즈

In [11]:
df = pd.DataFrame(np.random.randint(10,20, size=(7,2)), index=dates, columns=['A', 'B'])
df

             A   B
2020-02-10  16  14
2020-02-11  19  10
2020-02-12  14  13
2020-02-13  10  10
2020-02-14  10  14
2020-02-15  14  16
2020-02-16  15  19

In [12]:
df = pd.DataFrame(np.random.randint(1,101, size=(7,4)), columns=['A', 'B', 'C', 'D'])
df

    A   B   C   D
0   4  14  34  96
1  91  39   3  17
2  34  26  58  92
3  13  30  71  71
4  88  70  17  17
5  41  41   5  15
6  65  61  38   4

In [13]:
#인덱스 설명
df.index

RangeIndex(start=0, stop=7, step=1)

In [14]:
#컬럼, 데이터타입
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [15]:
#n-array 값
df.values

array([[ 4, 14, 34, 96],
       [91, 39,  3, 17],
       [34, 26, 58, 92],
       [13, 30, 71, 71],
       [88, 70, 17, 17],
       [41, 41,  5, 15],
       [65, 61, 38,  4]])

In [16]:
#각각의 타입을 유심히 보세요.
#앞의 2개는 pandas객체타입이고 마지막은 numpy의 객체타입입니다.
print(type(df.index))
print(type(df.columns))
print(type(df.values))

<class 'pandas.core.indexes.range.RangeIndex'>
<class 'pandas.core.indexes.base.Index'>
<class 'numpy.ndarray'>

In [17]:
#데이터프레임 정보 출력
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       7 non-null      int32
 1   B       7 non-null      int32
 2   C       7 non-null      int32
 3   D       7 non-null      int32
dtypes: int32(4)
memory usage: 240.0 bytes

In [18]:
#평균과 표준편차 등을 빠르고 간략하게 보여즙니다~!!!
df.describe()

               A          B          C          D
count   7.000000   7.000000   7.000000   7.000000
mean   48.000000  40.142857  32.285714  44.571429
std    34.506038  19.642035  25.921126  40.070177
min     4.000000  14.000000   3.000000   4.000000
25%    23.500000  28.000000  11.000000  16.000000
50%    41.000000  39.000000  34.000000  17.000000
75%    76.500000  51.000000  48.000000  81.500000
max    91.000000  70.000000  71.000000  96.000000

In [19]:
df

    A   B   C   D
0   4  14  34  96
1  91  39   3  17
2  34  26  58  92
3  13  30  71  71
4  88  70  17  17
5  41  41   5  15
6  65  61  38   4

In [20]:
#내림차순정렬
df.sort_values(by='A', ascending=False)

    A   B   C   D
1  91  39   3  17
4  88  70  17  17
6  65  61  38   4
5  41  41   5  15
2  34  26  58  92
3  13  30  71  71
0   4  14  34  96

In [21]:
df

    A   B   C   D
0   4  14  34  96
1  91  39   3  17
2  34  26  58  92
3  13  30  71  71
4  88  70  17  17
5  41  41   5  15
6  65  61  38   4

In [22]:
df['A']

0     4
1    91
2    34
3    13
4    88
5    41
6    65
Name: A, dtype: int32

In [23]:
df['B']

0    14
1    39
2    26
3    30
4    70
5    41
6    61
Name: B, dtype: int32

In [24]:
df

    A   B   C   D
0   4  14  34  96
1  91  39   3  17
2  34  26  58  92
3  13  30  71  71
4  88  70  17  17
5  41  41   5  15
6  65  61  38   4

In [26]:
#슬라이딩 index를 기준으로 사용가능합니다.
df[0:3]

    A   B   C   D
0   4  14  34  96
1  91  39   3  17
2  34  26  58  92

In [28]:
df[2:5]

    A   B   C   D
2  34  26  58  92
3  13  30  71  71
4  88  70  17  17

In [31]:
#df[0:['A']]  #동작하지 않는 코드입니다.

In [36]:
df.loc[2, ['A','B','C']]

A    34
B    26
C    58
Name: 2, dtype: int32

In [39]:
df.loc[1:6, ['B','C']]

    B   C
1  39   3
2  26  58
3  30  71
4  70  17
5  41   5
6  61  38

In [40]:
#index가 숫자가 아니라면???

In [44]:
df = pd.DataFrame(np.random.randint(10,100, size=(7,4)), index=dates, columns=['A', 'B','C','D'])
df

             A   B   C   D
2020-02-10  99  80  20  92
2020-02-11  23  18  45  95
2020-02-12  14  91  68  13
2020-02-13  13  77  85  24
2020-02-14  82  38  31  47
2020-02-15  59  30  81  30
2020-02-16  31  70  66  81

In [46]:
#df.loc[1:6, ['B','C']]   #인덱스문제로 에러발생

In [50]:
#데이터프레임 검색명령어, 매우중요!!!
df.loc['2020-02-10':'2020-02-15', ['A']]

             A
2020-02-10  99
2020-02-11  23
2020-02-12  14
2020-02-13  13
2020-02-14  82
2020-02-15  59

In [65]:
#인덱스 문제를 해결하는 iloc
#df.iloc[0:6, [A]] #에러발생!!  컬럼도 숫자값으로 지정해 주어야 합니다.

df.iloc[0:6, [0,1]]

             A   B
2020-02-10  99  80
2020-02-11  23  18
2020-02-12  14  91
2020-02-13  13  77
2020-02-14  82  38
2020-02-15  59  30

In [66]:
df.iloc[0:6, [1,3]]

             B   D
2020-02-10  80  92
2020-02-11  18  95
2020-02-12  91  13
2020-02-13  77  24
2020-02-14  38  47
2020-02-15  30  30

In [67]:
df.iloc[[1,3,5], [0,3]]

             A   D
2020-02-11  23  95
2020-02-13  13  24
2020-02-15  59  30

In [69]:
#특정컬럼 직접 엑세스가 가능합니다.
df.A

2020-02-10    99
2020-02-11    23
2020-02-12    14
2020-02-13    13
2020-02-14    82
2020-02-15    59
2020-02-16    31
Freq: D, Name: A, dtype: int32

In [77]:
#특정 
df[df.A > 40]

             A   B   C   D
2020-02-10  99  80  20  92
2020-02-14  82  38  31  47
2020-02-15  59  30  81  30

In [78]:
df.A[df.A > 40]

2020-02-10    99
2020-02-14    82
2020-02-15    59
Name: A, dtype: int32

In [80]:
#누적합을 구하고 싶을 때
df.apply(np.cumsum)

              A    B    C    D
2020-02-10   99   80   20   92
2020-02-11  122   98   65  187
2020-02-12  136  189  133  200
2020-02-13  149  266  218  224
2020-02-14  231  304  249  271
2020-02-15  290  334  330  301
2020-02-16  321  404  396  382

In [82]:
#최대값과 최소값의 차이를 알고 싶다면
df.apply(lambda x : x.max() - x.min())

A    86
B    73
C    65
D    82
dtype: int64